app/controllers/domains_controller.rb

INSERT INTO `domains` (`created_at`, `updated_at`, `url`) VALUES('2013-01-09 17:14:06', '2013-01-09 17:14:06', 'www.amazon.com')
---
  def sync
    list = params[:domains]
    domainNames = list.split(',')
    unless domainNames.blank?
      for domain in domainNames do
        newDomain = Domain.create(:url=>"#{domain}")